Repository: 84000/data-translation-memory
Catalog: toh112-v3.tmx
Source language: bo
Languages: en

source: །དེ་ན་རྒྱལ་པོ་གང་ཡིན་པ་དེ་འཆི་བའི་དུས་བྱས་པར་གྱུར་པ་དང་། དེ་ནས་རྒྱལ་པོའི་བློན་པོ་དེ་དག་གིས་གདོལ་པ་སྟོབས་ཅན་དེ་རྒྱལ་པོའི་དབང་བསྐུར་བས་དབང་བསྐུར་ཏེ་རྒྱལ་པོར་བཅུག་ནས་རྒྱལ་པོ་བསོད་ནམས་སྟོབས་ཞེས་བྱ་བར་གྱུར་ཏོ།
en: Then when the king passed away, the king’s ministers gave the royal consecration to that strong caṇḍāla, establishing him as the king, and he was known as King Puṇyabala. “

source: །རིགས་ཀྱི་བུ་དེ་ནས་རྒྱལ་པོ་བསོད་ནམས་སྟོབས་ཀྱིས་རིང་པོ་མ་ལོན་པར་ཡུལ་དེར་རྗེས་སུ་བསྟན་ཏེ། བརྩོན་འགྲུས་བརྟན་ཞིང་རྟུལ་བས་ཡུལ་གཉིས་པར་ཡང་རྗེས་སུ་བསྟན་ནས་རྒྱལ་པོ་བསོད་ནམས་སྟོབས་རིང་པོ་མ་ལོན་པར་འཛམ་བུའི་གླིང་ཐམས་ཅད་དུ་སྟོབས་ཀྱི་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོའི་བར་དུ་གྱུར་ཏོ། །གང་གི་ཚེ་རྒྱལ་པོ་བསོད་ནམས་སྟོབས་ཀྱིས་འཛམ་བུའི་གླིང་ཐམས་ཅད་ཀྱི་རྒྱལ་སྲིད་བཟུང་ནས།
en: Then, noble son, King Puṇyabala ruled that kingdom, and not long afterward, through his unwavering diligence, he came to rule a second kingdom, and soon King Puṇyabala became a cakravartin who ruled over the whole of Jambudvīpa.

source: དེའི་འོག་ཏུ་སེམས་ཅན་རྣམས་སྲོག་གཅོད་པ་སྤོང་བ་ཡང་དག་པར་འཛིན་དུ་བཅུག་ཅིང་བཙུད་དེ་རབ་ཏུ་བཀོད་དོ།
en: Not long after, King Puṇyabala had the entirety of the four continents as his kingdom and then made beings give up killing, follow that conduct, and remain in it.

source: །དེ་བཞིན་དུ་མ་བྱིན་པར་ལེན་པ་དང་། ལོག་པར་ལྟ་བའི་བར་དག་སྤོང་བ་ཡང་དག་པར་འཛིན་དུ་བཅུག་ཅིང་བཙུད་དེ་ཡང་དག་པའི་ལྟ་བའི་བར་དག་ལ་རབ་ཏུ་བཀོད་དོ།
en: Similarly, he made beings give up taking what has not been given, and so on, up to and including having wrong views, and he established them in the correct view.

source: །སེམས་ཅན་རྣམས་བསམ་པ་ཇི་ལྟ་བུ་བཞིན་དུ་ཐེག་པ་གསུམ་པོ་དག་ཡང་དག་པར་འཛིན་དུ་བཅུག་ཅིང་བཙུད་དེ་རབ་ཏུ་བཀོད་དོ།
en: He also brought beings to the three yānas, in accordance with their aspirations, and made them enter and remain in them. “

source: །དེ་ནས་རྒྱལ་པོ་བསོད་ནམས་སྟོབས་ཀྱིས་འཛམ་བུའི་གླིང་གི་སེམས་ཅན་ཐམས་ཅད་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་དག་ལ་རབ་ཏུ་བཀོད་ཅིང་ཐེག་པ་གསུམ་པོ་དག་ལ་ངེས་པར་སྦྱར་ནས་འཛམ་བུའི་གླིང་ཐམས་ཅད་དུ་སྒྲ་དབྱངས་རྗེས་སུ་བསྒྲགས་པ།
en: Then King Puṇyabala established all the beings in Jambudvīpa in the path of the ten good actions and had them follow the three yānas, and his fame spread throughout all of Jambudvīpa.

source: སློངས་མོ་པ་གང་སུ་དག་ཟས་འདོད་པ་དང་། རིན་པོ་ཆེའི་བར་དག་འདོད་པ་དེ་དག་ཐམས་ཅད་ཚུར་ཤོག་ཤིག་དང་།
en: He made a proclamation that said, ‘Anyone who wants food, and so on, up to and including jewels, come here!

source: ངས་ཐམས་ཅད་ལ་སྦྱིན་པ་སྦྱིན་པར་བྱའོ་ཞེས་བསྒྲགས་སོ།
en: I will give you everything!’ “

source: །དེ་ནས་དུས་གཞན་ཞིག་གི་ཚེ་ན་འཛམ་བུའི་གླིང་གི་སེམས་ཅན་ཐམས་ཅད་ལྷགས་ནས་རྒྱལ་པོ་བསོད་ནམས་སྟོབས་ལ་སློངས་མོ་བྱེད་པར་གྱུར་པ་དང་།
en: Later, all the beings in Jambudvīpa came to petition King Puṇyabala.

source: རྒྱལ་པོ་བསོད་ནམས་སྟོབས་ཀྱིས་ཀྱང་དེ་དག་ལས་བརྩམས་ཏེ་སྦྱིན་པ་རྣམ་པ་སྣ་ཚོགས་དག་བྱིན་ནོ།
en: King Puṇyabala commenced to make a variety of gifts to them.

source: །དེ་ནས་འཚོ་བ་པ་རྡུལ་དབྱངས་ཞེས་བྱ་བ་ཞིག་རྒྱལ་པོ་བསོད་ནམས་སྟོབས་ཀྱི་དྲུང་དུ་སོང་སྟེ་སྨྲས་པ། རྒྱལ་པོ་ཆེན་པོ་གལ་ཏེ་ཁྱོད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་བཞེད་ཅིང་སྦྱིན་པ་ཆེན་པོ་རྣམ་པ་སྣ་ཚོགས་ཡོངས་སུ་གཏོང་བ་དག་ཡོངས་སུ་གཏོང་བར་མཛད་ལ། རྒྱལ་པོ་ཆེན་པོ་གལ་ཏེ་ཁྱོད་ཀྱིས་བདག་གི་བསམ་པ་ཡོངས་སུ་རྫོགས་པར་མཛད་པར་འགྱུར་ན་ནི་རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་རྒྱལ་བ་འཇིག་རྟེན་གྱི་སྒྲོན་མར་འགྱུར་ལགས་སོ།
en: Then an ājīvika named Pāṃśughoṣa came before him and said, ‘Great king, if you are giving away a variety of gifts in a great act of generosity, if you are intent upon the highest, most complete enlightenment, and if you, great king, fulfill my wishes, then, great king, you will be a jina who is a lamp for this world.’ “ ‘

source: །རྒྱལ་པོས་སྨྲས་པ་ཁྱོད་ཅི་ཞིག་འདོད།
en: What is it you want?’ asked the king. “ ‘

source: འཚོ་བ་པ་རྡུལ་དབྱངས་ཀྱིས་སྨྲས་པ། རྒྱལ་པོ་ཆེན་པོ་བདག་ནི་ལྷ་མ་ཡིན་གྱི་གཡུལ་ཆེན་པོར་རབ་ཏུ་འཇོམས་པའི་རིག་སྔགས་འཆང་ཉིད་འཚལ་ན།
en: Great king,’ answered the ājīvika Pāṃśughoṣa, ‘I wish to possess a spell so that through a ritual I can defeat great asuras in battle.

source: ཆོ་ག་ཞིབ་མོ་བསྒྲུབ་པའི་སླད་དུ་མི་གསོན་པོའི་པགས་པ་ཡང་འཚལ། མིག་ཀྱང་འཚལ་ཏེ། དེའི་སླད་དུ་བདག་ཁྱོད་ཀྱི་སྤྱན་སྔར་མཆིས་ནས་གསོལ་བ་བགྱིད་ལགས་སོ།
en: This is why I stand before you and address you: I need the skin and the eyes of a living human being.’ “

source: །རིགས་ཀྱི་བུ་དེ་ནས་རྒྱལ་པོ་བསོད་ནམས་སྟོབས་འདི་སྙམ་དུ་སེམས་ཏེ། བདག་གིས་སྟོབས་ཀྱི་འཁོར་ལོས་སྒྱུར་བ་ཉིད་ཐོབ་ནས་སེམས་ཅན་བགྲང་བ་ལས་འདས་པ་དག་ཅིག་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་རབ་ཏུ་བཀོད་ཅིང་།
en: Then, noble son, King Puṇyabala thought, ‘I have become a powerful cakravartin; I have brought countless beings onto the path of the ten good actions.

source: ཐེག་པ་གསུམ་པོ་དག་ལ་ཡང་ངེས་པར་སྦྱར་ཏེ། བདག་གིས་སྦྱིན་པ་ཡང་དཔག་ཏུ་མེད་པ་ཞིག་བྱིན་ན།
en: I have also brought them into the three yānas, and I have performed an immeasurable act of generosity.

source: ད་ནི་སྙིང་པོ་མེད་པའི་ལུས་ལས་སྙིང་པོ་ལེན་པར་བྱེད་པ་ཞིག་སྟེ།
en: This person is my kalyāṇamitra. I shall give him the essence of my essenceless body.’ “

source: བདག་གི་དགེ་བའི་བཤེས་གཉེན་ཡིན་ནོ་སྙམ་ནས་རྒྱལ་པོས་སྨྲས་པ། ངས་ཁྱོད་ལ་ཤའི་མིག་ཐ་མལ་པ་འདི་སྦྱིན་པར་བྱས་དགའ་བར་གྱིས་ཤིག །
en: The king said, ‘Rejoice, for I shall give you my ordinary physical eyes.

source: དེས་ནི་བདག་གིས་བླ་ན་མེད་པའི་ཆོས་ཀྱི་སྤྱན་ཐོབ་པར་གྱུར་ཅིག །
en: Through this may I obtain the unsurpassable Dharma eyes.

source: ངས་ཁྱོད་ལ་རབ་ཏུ་དང་བའི་སེམས་ཀྱིས་རང་གི་པགས་པ་འདི་ཡང་སྦྱིན་པར་བྱས་དེས་ནི་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཐོབ་པར་གྱུར་ཅིག །
en: I shall with delight give you this skin of mine, and through that may I attain the highest, most complete enlightenment.’ “

source: རིགས་ཀྱི་བུ་དེ་ནས་རྒྱལ་པོ་བསོད་ནམས་སྟོབས་ཀྱིས་ལག་པ་གཡས་པས་རང་གི་མིག་གཉིས་ཕྱུང་སྟེ་འཚོ་བ་པ་ལ་བྱིན་ནས་གདོང་ཁྲག་གིས་ཡོག་བཞིན་དུ་སྨྲས་པ། འདི་ན་གང་དག་འདིར་ལྷགས་པ་དང་།
en: Then, noble son, King Puṇyabala pulled out his eyes with his right hand and gave them to the ājīvika.

source: ནམ་མཁའ་ལ་རྒྱུ་བ་དང་། ས་ལ་གནས་པའི་ལྷ་རྣམས་དང་། གནོད་སྦྱིན་མཐུ་ཆེན་པོ་རྣམས་དང་། མིའམ་ཅི་གང་ཡིན་པ་རྣམས་དང་། ལྷ་མ་ཡིན་གང་ཡིན་པ་རྣམས་དང་།
en: With his face covered with blood he said, ‘Listen to me, you powerful devas and yakṣas, you kinnaras, you asuras and bhūtas, you who live in the air and on the ground, and you humans who have come here.

source: འབྱུང་པོ་གང་ཡིན་པ་རྣམས་དང་། མི་གང་ཡིན་པ་རྣམས་བདག་ལ་ཉོན་ཅིག །བདག་གིས་སྦྱིན་པ་བྱང་ཆུབ་ཏུ་བསྔོས་པའི་དགེ་བས་ཞི་བའི་གོ་འཕང་ཐོབ་པར་གྱུར་ནས། བདག་གིས་སེམས་ཅན་རྣམས་འཁོར་བའི་རྒྱ་མཚོ་མི་ཟད་པ་ལས་སྒྲོལ་ཞིང་བླ་ན་མེད་པའི་ཞི་བ་མྱ་ངན་ལས་འདས་པ་ལ་འགོད་པར་གྱུར་ཅིག །
en: Through the good karma of dedicating this act of generosity to the attainment of enlightenment, may I attain the state of peace, liberate beings, and bring them from the terrifying ocean of saṃsāra to the unsurpassable peace of nirvāṇa.’ “

source: ཡང་སྨྲས་པ། གལ་ཏེ་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཐོབ་པར་འགྱུར་བ་ལྟ་ན། ཇི་སྲིད་དུ་འཚོ་བ་པ་འདིའི་རིག་སྔགས་དེ་གྲུབ་པར་མ་གྱུར་པ་དེ་སྲིད་ཀྱི་བར་དུ་བདག་གི་སྲོག་གི་དབང་པོ་འགག་པར་མ་གྱུར་ཅིག །བདག་གི་དྲན་པ་ཡང་ཉམས་པར་མ་གྱུར་ཅིག །བདག་འགྱོད་པར་ཡང་མ་གྱུར་ཅིག །
en: He also said, ‘If I am to attain the highest, most complete enlightenment, then may my life not end, may I not lose consciousness, and may I not fall down until this ājīvika’s spells have been effective.’ “

source: རིགས་ཀྱི་བུ་རྒྱལ་པོས་པགས་པ་ཡང་ཁྱེར་ཅིག་ཅེས་སྨྲས་པ་དང་། འཚོ་བ་པ་རྡུལ་དབྱངས་དེས་མཚོན་རྣོན་པོ་བླངས་ཏེ། རྒྱལ་པོ་གསོན་པོའི་ལུས་ལས་པགས་པ་བཤུས་ནས་པགས་པ་ཁྱེར་ཏེ་རིག་སྔགས་བསྒྲུབས་སོ།
en: Noble son, the king said, ‘Take my skin,’ and Ājīvika Pāṃśughoṣa took a sharp knife and flayed the skin from the king’s living body, took it, and practiced his spell.

source: །དེ་ལྟར་ཞག་བདུན་གྱི་བར་དུ་རྒྱལ་པོ་བསོད་ནམས་སྟོབས་ཀྱི་སྲོག་གི་དབང་པོ་ཡང་མ་འགགས་དྲན་པ་ཡང་མ་ཉམས། སྡུག་བསྔལ་གྱི་ཚོར་བ་དེ་ཡང་མ་མྱོང་ལ། དེ་ལ་སྐད་ཅིག་ཙམ་ཡང་འགྱོད་པ་སྐྱེས་པར་མ་གྱུར་ཏོ། །རིགས་ཀྱི་བུ་འདི་ཇི་སྙམ་དུ་སེམས།
en: For seven days King Puṇyabala remained alive, did not lose consciousness, did not experience any suffering, and did not feel regret for even a moment. “

source: དེའི་ཚེ་དེའི་དུས་ན་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཞིག་ཡིན་པ་སྙམ་དུ་འཛིན་ན་གཞན་དུ་མི་བལྟ་སྟེ།
en: Noble son, who do you think was at that time, in that period, the one named Mahākāruṇika? Do not look elsewhere.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོའི་ཡབ་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་ཞེས་བྱ་བ་དེར་གྱུར་ཏོ།
en: I was that Mahākāruṇika, the father of the Tathāgata Ratnagarbha.

source: །ངས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་གྱུར་པའི་དང་པོ་ནི་དེ་ཡིན་ནོ།
en: That was the time when I first developed the aspiration for the highest, most complete enlightenment.

source: །ངས་དང་པོ་སེམས་བསྐྱེད་པས་སེམས་ཅན་བགྲང་བ་ལས་འདས་པ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་བཅུག་སྟེ།
en: Through my first development of that aspiration, I made many beings adopt, enter, and remain in having the highest, most complete enlightenment as their goal.

source: ངས་དཔའ་བའི་དངོས་པོ་དང་། དཔའ་བོའི་བྱ་བ་དང་པོ་ནི་དེ་ཡིན་ནོ།
en: That was my first heroism, my first heroic act. “

source: །ང་སྨོན་ལམ་གྱི་དབང་གིས་དེ་ནས་ཤི་འཕོས་ནས་སངས་རྒྱས་ཀྱི་ཞིང་ཡང་དག་འདྲེན་དུ་གདོལ་པའི་རིགས་སུ་སྐྱེས་པ་དེའི་ཚེ་ན་ངས་གདོལ་པའི་རིགས་སུ་གནས་ནས་སེམས་ཅན་རྣམས་དགེ་བ་ལ་སྦྱར་ཅིང་རང་གི་སྟོབས་དང་རྟུལ་བས་སྟོབས་ཀྱི་འཁོར་ལོས་སྒྱུར་བ་ཉིད་ཐོབ་པའི་བར་དང་།
en: When I died, through the power of my prayers I was reborn in Saṃkarṣana into a caṇḍāla family. While I was a member of the caṇḍāla class, I made beings practice good actions. Because of my strength and courage, I became a powerful cakravartin.

source: འཛམ་བུའི་གླིང་ཐམས་ཅད་དུ་འཐབ་པ་དང་རྩོད་པའི་རྙོག་པ་རྣམས་རབ་ཏུ་ཞི་བར་བྱས་ཤིང་།
en: I brought all fighting, strife, and impurity throughout Jambudvīpa to an end, and extended the lifespan of the people.

source: ཚེ་ཡང་བསྲིངས་ཏེ་ངས་དང་པོ་ལུས་ཡོངས་སུ་བཏང་བ་དེ་ནི་ངའི་དཔའ་བའི་དངོས་པོ་དང་།
en: At that time, I made a gift of my body for the first time.

source: དཔའ་བོའི་བྱ་བ་གཉིས་པ་ཡིན་ནོ།
en: That was my second heroism, my second heroic act. “

source: །གང་གི་ཚེ་ངས་རང་གི་མིག་དག་ཡོངས་སུ་བཏང་ཞིང་རང་གི་པགས་པ་ཡང་ཡོངས་སུ་བཏང་སྟེ། དེ་ནས་ཤི་འཕོས་ན་ཡང་སྨོན་ལམ་གྱི་དབང་གིས་སངས་རྒྱས་ཀྱི་ཞིང་ཡང་དག་འདྲེན་དེ་ཉིད་ཀྱི་གླིང་གཉིས་པར་གདོལ་པའི་རིགས་སུ་སྐྱེས་ནས་སྔ་མ་བཞིན་དུ་སྦྱར་ཏེ།
en: I gave away my own eyes, I gave away my own skin, and when I passed away, through the power of my prayers I was reborn in a caṇḍāla family in the second continent of the Saṃkarṣana buddha realm.

source: དེར་ཡང་ངས་བརྩོན་འགྲུས་བརྟན་ཞིང་རྟུལ་བ་དེ་ལྟ་བུས་སེམས་ཅན་རྣམས་དགེ་བའི་ལས་དག་ལ་ངེས་པར་སྦྱར་ནས་སྟོབས་ཀྱི་འཁོར་ལོས་སྒྱུར་བའི་བར་ཡང་ཐོབ་སྟེ།
en: Then it was as previously described, and through the power of my unwavering diligence I brought beings to the practice of good actions, and so on, up to and including becoming a powerful cakravartin.

source: དེར་ཡང་འཐབ་པ་དང་རྩོད་པའི་རྙོག་པ་དང་། འཁོན་པ་དང་། འགྱོད་པ་དག་རབ་ཏུ་ཞི་བར་བྱས་ཏེ་ཚེ་ཡང་བསྲིངས་སོ།
en: I brought to an end fighting, strife, impurity, vengeance, and discord, and lengthened the lifespans of the people. “

source: །དེར་ཡང་རང་གི་ལུས་ལས་ལྕེ་དང་།
en: There I gave away the tongue and ears from my own body.

source: རྣ་བ་དག་ཡོངས་སུ་བཏང་བ་ན་སངས་རྒྱས་ཀྱི་ཞིང་ཡང་དག་འདྲེན་གྱི་སྟོང་ཆེན་པོ་དེ་ཀུན་གྱི་གླིང་ཐམས་ཅད་ཀྱི་བར་དུ་ཡང་སྐྱེས་བུའི་རྩལ་དེ་ལྟ་བུ་དག་བྱས་སོ།
en: I displayed this kind of heroism throughout all the continents in the entire billion-world universe that was the Saṃkarṣana buddha realm. “

source: །སྨོན་ལམ་དང་བརྩོན་འགྲུས་བརྟན་ཞིང་རྟུལ་བ་རྗེས་སུ་འབྲེལ་བ་དང་། སྨོན་ལམ་གྱི་དབང་གིས་སྙིགས་མ་ལྔ་དང་ལྡན་པའི་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ཏུ་ཡང་སེམས་ཅན་རྣམས་དགེ་བའི་རྩ་བ་དེ་དག་ལ་ངེས་པར་སྦྱར་ཅིང་ཐེག་པ་གསུམ་པོ་དག་ཡང་དག་པར་འཛིན་དུ་བཅུག་སྟེ།
en: Through connection with my prayers and my courageous, unwavering diligence, and through the power of my prayers, I brought beings in impure buddha realms as numerous as the grains of sand in the Ganges River to the practice of good actions and made them obtain, enter, and remain in the three yānas.

source: འཐབ་པ་དང་རྩོད་པའི་རྙོག་པ་དང་། ཉོན་མོངས་པ་དང་། འཁོན་པ་དང་། འགྱེད་པ་རྣམས་རབ་ཏུ་ཞི་བར་བྱས་ཤིང་སྐྱེས་བུ་ཆེན་པོའི་རྩལ་དེ་ལྟ་བུ་དག་བྱས་སོ།
en: I brought to an end fighting, strife, impurity, the kleśas, vengeance, and discord, demonstrating that kind of great fortitude. “

source: །རིགས་ཀྱི་བུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གཞན་དག་གི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་ནི་འདིའི་ཕྱིར་ཏེ།
en: Noble son, other bhagavat buddhas have pure realms.

source: གང་གི་ཚེ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་སྔོན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་སྤྱད་པ་སྤྱོད་པ་ན་གཞན་གྱི་ལྟུང་བ་གླེང་བར་མི་བྱེད་ཅིང་གཞན་ལ་འཇིགས་པ་སྟོན་པར་མི་བྱེད་ལ། སེམས་ཅན་རྣམས་ཉན་ཐོས་དང་།
en: This is because when those buddhas, those bhagavats, previously practiced the conduct that leads to the highest, most complete enlightenment, they did not instigate others to the downfalls, and they did not show fear to others, and they did not bring beings into the Śrāvakayāna or Pratyekabuddhayāna.

source: རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ཡང་དག་པར་འཛིན་དུ་མ་བཅུག་པས་ན་དེའི་ཕྱིར་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དགོངས་པ་ཡོངས་སུ་རྫོགས་པ་དེ་དག་གི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་གྱུར་ཏེ།
en: That is why the buddha realms that are the fulfillment of the intentions of those buddhas and bhagavats are completely pure.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་ལྟུང་བའི་མིང་ཡང་མེད་ལ། བསླབ་པ་གཟུང་བ་ཡང་མེད། ཚིག་རྩུབ་པོ་ཡང་མི་གྲག །མི་དགེ་བའི་སྒྲ་ཡང་མི་གྲག་སྟེ།
en: In those buddha realms there aren’t even the words downfall or following training, no harsh speech is heard, and there aren’t even the words bad action.

source: གཞན་དུ་ན་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ཆོས་ཀྱི་སྒྲ་དང་། ཡིད་དུ་མི་འོང་བ་མེད་པའི་སྒྲས་ཁྱབ་པ་ཡིན་ནོ།
en: Instead, those buddha realms are filled by the sound of the words of the Dharma and sounds that are not unpleasant.

source: །དེ་ན་སེམས་ཅན་རྣམས་ཀྱང་ཇི་ལྟར་འདོད་པ་བཞིན་དུ་བྱེད་པ་ཡིན་ཏེ།
en: There the beings do just as they wish.

source: དེ་ན་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ཐེག་པའི་མིང་དུ་གདགས་པ་ཙམ་ཡང་མི་སྲིད་དོ།
en: The terms Śrāvakayāna and Pratyekabuddhayāna do not even appear there. “

source: །ངས་ནི་གང་གི་ཚེ་བསྐལ་པ་ཆེན་པོ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་སྙིགས་མ་ལྔ་དང་ལྡན་པའི་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ཏུ་ཚིག་རྩུབ་པོ་དང་འཇིགས་སུ་རུང་བས་སེམས་ཅན་རྣམས་སྲོག་གཅོད་པ་སྤོང་བ་ཡང་དག་པར་འཛིན་དུ་བཅུག་ཅིང་བཙུད་དེ་རབ་ཏུ་བཀོད་པ་ནས། ཐེག་པ་གསུམ་པོ་དག་ཀྱང་ཡང་དག་པར་འཛིན་དུ་བཅུག་ཅིང་བཙུད་དེ་རབ་ཏུ་བཀོད་པའི་བར་དུ་བྱས་པས་ན།
en: Throughout great eons as numerous as the grains of sand in the Ganges River, in empty buddha realms with the five degeneracies, I have made beings come to, enter into, and remain in abstention from killing, and made them come to, enter into, and remain in the three yānas.

source: དེའི་ལས་ཀྱི་འཕྲོས་ད་ལྟར་ང་ཉོན་མོངས་པ་དང་ལྡན་ཞིང་མི་དགེ་བའི་སྒྲས་ཀུན་ཏུ་ཁྱབ་ལ་མི་དགེ་བའི་རྩ་བ་དང་ལྡན་པའི་སེམས་ཅན་རྣམས་ཀྱིས་ཡོངས་སུ་གང་བའི་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ལྟ་བུ་ན་ཐེག་པ་གསུམ་གྱིས་ཆོས་སྟོན་ཏེ།
en: Through the power of that karma, I now teach the Dharma of the three yānas in an afflicted buddha realm that is filled with the words bad actions and is filled with beings who possess bad roots.

source: ངས་ནི་སྔོན་ཇི་ལྟར་སྨོན་ལམ་བཏབ་པ་དེ་ལྟ་བུའི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་བཟུང་ཞིང་ངས་འདུལ་བའི་སེམས་ཅན་ཇི་ལྟ་བུ་དག་ཡོངས་སུ་བཟུང་བ་དེ་ལྟ་བུ་ཁོ་ནའི་སྟོབས་དང་།
en: I have adopted a buddha realm that accords with the prayers that I have made in the past.

source: བརྩོན་འགྲུས་དང་། འབད་པས་བྱང་ཆུབ་ཀྱི་སྤྱོད་པ་སྤྱད་དེ་སྨོན་ལམ་ཇི་ལྟ་བུ་བཏབ་ཅིང་།
en: I have practiced the conduct that leads to enlightenment with the strength, diligence, and effort that accords with the beings whom I have chosen to be my disciples.

source: ས་བོན་ཅི་འདྲ་བ་བཏབ་པ་དེ་འདྲ་བའི་སངས་རྒྱས་ཀྱི་ཞིང་ཐོབ་བོ།། །།
en: I have obtained a buddha realm that accords with the prayers I have made and the seeds I have planted. “

source: བམ་པོ་བཅུ་བཞི་པ། རིགས་ཀྱི་བུ་ཇི་ལྟར་ངས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་སྦྱིན་པ་ཡོངས་སུ་གཏོང་བ་ཡོངས་སུ་བཏང་བ་ལྟར། སྔོན་གྱི་བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་ཀྱང་དེ་ལྟ་བུའི་སྦྱིན་པ་ཡོངས་སུ་གཏོང་བ་ཡོངས་སུ་མ་བཏང་ལ། ཇི་ལྟར་ངས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་སྦྱིན་པ་ཡོངས་སུ་གཏོང་བ་ཡོངས་སུ་བཏང་བ་ལྟར་ཕྱིས་འབྱུང་བར་འགྱུར་བའི་བྱང་ཆུབ་སེམས་དཔའ་གང་ཡང་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་དེ་ལྟ་བུའི་སྦྱིན་པ་ཡོངས་སུ་གཏོང་བ་ཡོངས་སུ་གཏོང་བར་མི་འགྱུར་བའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་མདོར་བསྡུས་ཏེ་ཁྱོད་ལ་བཤད་པར་བྱའོ།
en: Noble son, I will describe to you in brief my perfection of generosity. No bodhisattva in the past has accomplished acts of generosity like the acts of generosity that I have accomplished while practicing bodhisattva activity, and no bodhisattva in the future will accomplish acts of generosity like the acts of generosity that I have accomplished while practicing bodhisattva activity. “

source: །སྐྱེས་བུ་དམ་པ་བརྒྱད་ནི་མ་གཏོགས་ཏེ།
en: There are, besides, eight worthy beings.

source: སྐྱེས་བུ་དམ་པ་སས་བྱིན་ཞེས་བྱ་བར་གྱུར་པ་ནི་ལྷོ་ཕྱོགས་ལོགས་སུ་འཇིག་རྟེན་གྱི་ཁམས་ཀུན་དབྱངས་ཞེས་བྱ་བར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ།
en: There has been the worthy being named Dharaṇidatta who attained the highest, most complete enlightenment, becoming completely enlightened in the southern realm called Sarvaghoṣa.

source: དེ་བཞིན་གཤེགས་པ་འདྲེས་སྤོང་འོད་ཟེར་ཞེས་བྱ་བར་གྱུར་ནས་སྐྱེ་དགུ་ཚེ་ལོ་བརྒྱ་པ་རྣམས་ལ་ཆོས་སྟོན་ཅིང་ཞག་བདུན་ན་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་རོ།
en: He became the tathāgata named Saṃkaramardārci, taught beings whose lifespan was a hundred years, and on the seventh day passed into parinirvāṇa. “

source: །དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་བརྩོན་འགྲུས་ཡང་དག་སྐུལ་ཞེས་བྱ་བ་དེ་ནི་ཤར་ཕྱོགས་སུ་འཇིག་རྟེན་གྱི་ཁམས་མི་འཕམ་ཅན་ཞེས་བྱ་བར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ། སྐྱེ་དགུའི་ཚེ་ལོ་བརྒྱ་པ་རྣམས་ལ་བསྐལ་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ལས་ལྷག་པ་སྙེད་དུ་སངས་རྒྱས་ཀྱི་མཛད་པ་མཛད་ནས་དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་དེ་བླ་ན་མེད་པའི་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ཏེ།
en: In the same way, the bodhisattva named Vīryasaṃcodana attained the highest, most complete enlightenment in the eastern realm called Ajayavatī, and for beings whose lifespan was a hundred years he accomplished the deeds of a buddha for more eons than there are grains of sand in the Ganges River.

source: ད་དུང་དུ་ཡང་ཐུགས་རྗེ་ཆེན་པོ་དང་ལྡན་པ་དེའི་སྐུ་གདུང་རྣམས་སྙིགས་མ་ལྔ་དང་ལྡན་པའི་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་པ་དག་ན་སངས་རྒྱས་ཀྱི་མཛད་པ་མཛད་དོ།
en: Since that tathāgata passed into nirvāṇa, into unsurpassable nirvāṇa, the relics of that greatly compassionate one still continue to accomplish the deeds of a buddha in empty buddha realms that have the five degeneracies. “

source: །དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སྙིང་པོ་མེ་ཏོག་རྒྱས་ཞེས་བྱ་བ་ནི་བརྩོན་འགྲུས་དང་། ཡི་དམ་བརྟན་པ་དང་། ཡོངས་སུ་གཏོང་བའི་སྟོབས་ཀྱི་ཤུགས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་དེ།
en: In the same way, the bodhisattva named Sārakusumita practiced the conduct of a bodhisattva with unwavering diligence and samādhi and with the power of generosity.

source: དེ་བསྐལ་པ་ཆེན་པོ་གང་གཱའི་ཀླུང་བཅུའི་བྱེ་མ་སྙེད་འདས་པའི་འོག་ཏུ་འདི་ནས་བྱང་ཕྱོགས་སུ་སྙིགས་མ་ལྔ་དང་ལྡན་པའི་སངས་རྒྱས་ཀྱི་ཞིང་རྒྱུ་བཅས་ཡང་དག་འདྲེན་ཅེས་བྱ་བ་ཞིག་འབྱུང་བར་འགྱུར་བ་དེར་སྐྱེས་བུ་དམ་པ་དེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ།
en: After as many great eons as there are grains of sand in ten Ganges Rivers, that worthy being attained the highest, most complete enlightenment in a buddha realm that had the five degeneracies, which was in the northern direction and had the name Sahetusaṃskarṣana.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྒྱུར་བཅས་ནག་པོ་རྣམ་པར་འཇོམས་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་བར་དུ་འགྱུར་རོ།
en: He became the tathāgata arhat samyaksam­buddha, and so on, up to and including the buddha bhagavat, named Sahetukṛṣṇavidhvaṃsanarāja. “

source: །བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་འོད་ཟེར་ཀུན་ནས་འཁྲུགས་འཛིན་ཅེས་བྱ་བའི་སྐྱེས་བུ་དམ་པ་དེ་ནི་བསྐལ་པ་ཆེན་པོ་གཅིག་འདས་ནས་ནུབ་ཕྱོགས་ལོགས་སུ་སྙིགས་མ་ལྔ་དང་ལྡན་པའི་འཇིག་རྟེན་གྱི་ཁམས་འཇིགས་ལྡན་ཞེས་བྱ་བ་ཞིག་འབྱུང་བར་འགྱུར་བ་དེར་སྐྱེ་དགུའི་ཚེ་ལོ་བརྒྱ་པའི་ནང་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ།
en: The worthy being, the bodhisattva Prajñārciḥsaṃkopitadaṣṭa, after one great eon had passed attained the highest, most complete enlightenment in a buddha realm that had the five degeneracies, that was in the western direction, that had the name Bhairavatī, and where the lifespan of beings was a hundred years.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཉི་མའི་སྙིང་པོའི་འོད་ཟེར་དྲི་མ་མེད་པའི་དབང་པོ་ཞེས་བྱ་བ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་བར་དུ་འགྱུར་རོ།
en: He became the tathāgata arhat samyaksam­buddha, and so on, up to and including the buddha bhagavat, named Sūryagarbhārcivimalendra. “

source: །ལེགས་དགའ་འདི་ཡང་བསྐལ་པ་བགྲང་བ་ལས་ཡང་དག་པར་འདས་པ་སྙེད་རྫོགས་པའི་འོག་ཏུ། སྟེང་གི་ཕྱོགས་ལོགས་སུ་བསྐལ་པ་ཆེན་པོ་རྩོད་རྙོག་མི་བཟད་ཡང་དག་འཁྲུག་ཅེས་བྱ་བ་ལ་སྙིགས་མ་ལྔ་དང་ལྡན་པའི་འཇིག་རྟེན་གྱི་ཁམས་འགྱུར་བྱེད་མི་གཙང་བསྩགས་ཞེས་བྱ་བ་ཞིག་འབྱུང་བར་འགྱུར་ཏེ།
en: As for Saṃrocana, after truly countless eons have passed, in the great eon Tīvrakaluṣasaṃkṣobhana, there will be a buddha realm in the upward direction that has the five degeneracies and the name Kṣāravarcanikuñjitā.

source: ལེགས་དགའ་འདི་སྔོན་གྱི་སྨོན་ལམ་གྱི་དབང་གིས་སངས་རྒྱས་ཀྱི་ཞིང་འགྱུར་བྱེད་མི་གཙང་བསྩགས་ཞེས་བྱ་བ་དེར་སྐྱེ་དགུའི་ཚེ་ལོ་ལྔ་བཅུ་པ་རྣམས་ཀྱི་ནང་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ།
en: This Saṃrocana, through the power of his prayers, will attain the highest, most complete enlightenment in the realm Kṣāravarcanikuñjitā, among beings whose lifespan is fifty years.

source: དེ་བཞིན་གཤེགས་པ་བསམ་ཡས་རྣམ་པར་སྣང་མཛད་ཅེས་བྱ་བ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་བར་དུ་འགྱུར་ཞིང་།
en: He will become the tathāgata arhat samyaksam­buddha, and so on, up to and including the buddha bhagavat, named Acintyarocana.

source: དེ་སྔོན་གྱི་སྨོན་ལམ་གྱི་དབང་གིས་ལོ་བཅུས་སངས་རྒྱས་ཀྱི་མཛད་པ་མཐའ་དག་མཛད་ནས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་ཏེ།
en: Through the power of his former prayers, he will accomplish all the deeds of a buddha for ten years and then pass into nirvāṇa.

source: དེ་ཉིད་ཀྱི་ཉིན་མོ་དེ་བཞིན་གཤེགས་པ་དེའི་དམ་པའི་ཆོས་ཀྱང་ནུབ་པར་འགྱུར་ཞིང་ལོ་བཅུའི་བར་དུ་སངས་རྒྱས་ཀྱི་ཞིང་དེ་སྟོངས་པར་འགྱུར་རོ།
en: On that day, the Dharma of that tathāgata will also come to an end, and for ten years that buddha realm will be empty. “

source: །དེའི་འོག་ཏུ་བྱང་ཆུབ་སེམས་དཔའ་རབ་ཏུ་ལག་བརྐྱང་འདི་སྔོན་གྱི་སྨོན་ལམ་གྱི་དབང་གིས་སངས་རྒྱས་ཀྱི་ཞིང་འགྱུར་བྱེད་མི་གཙང་བསྩགས་དེར་སྐྱེ་དགུའི་ཚེ་ལོ་སུམ་ཅུ་པ་རྣམས་ཀྱི་ནང་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ།
en: After that, the bodhisattva Prahasitabāhu, through the power of his prayers, will attain the highest, most complete enlightenment in that buddha realm Kṣāravarcanikuñjitā at the time when beings have a lifespan of thirty years.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཆོས་རྣམ་པར་སྣང་མཛད་ཅེས་བྱ་བ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་བར་དུ་འགྱུར་ཞིང་།
en: He will become the tathāgata arhat samyaksam­buddha, and so on, up to and including the buddha bhagavat, named Vairocanadharma.

source: དེ་ཡང་སྔོན་གྱི་སྨོན་ལམ་གྱི་དབང་གིས་ལོ་བཅུས་སངས་རྒྱས་ཀྱི་མཛད་པ་མཐའ་དག་མཛད་ནས། ཕུང་པོའི་ལྷག་མ་མེད་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་ཏེ།
en: Through the power of his former prayers, he will accomplish all the deeds of a buddha in ten years and then pass into nirvāṇa, into the state of nirvāṇa without any remaining aggregates.

source: དེའི་དམ་པའི་ཆོས་ནི་ལོ་བདུན་དུ་གནས་པར་འགྱུར་རོ།
en: His Dharma will remain for seven years.”

source: །དེ་ནས་སྐྱེས་བུ་དམ་པ་དེ་གཉིས་ཀྱིས་སྔར་ལུང་བསྟན་པ་ཐོབ་ཅིང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་རོ་མྱོང་བ་ཐོབ་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ།
en: Those two worthy beings, having received these prophecies and tasted the flavor of the highest, most complete enlightenment, bowed down their heads to the feet of the Bhagavat.
